app/controllers/movies_controller.rb

  def index
    @movies = Movie.all

          @sortby = params[:sortby]||session[:sortby]
          if @sortby
           @movies=Movie.order(@sortby)
         end
    @all_ratings= Movie.collectrating
    @ratingshash=params[:ratings]||session[:ratings]||{}



    if params[:sortby]!=session[:sortby]
      session[:sortby]=@sortby
      redirect_to movies_path(:sortby=>@sortby, :ratings=>@ratingshash) and return
    end

    if params[:ratings] !=session[:ratings] and params[:ratings]!={}
      session[:ratings]=@ratingshash
      redirect_to movies_path(:sortby=>@sortby, :ratings=>@ratingshash) and return
   end
      @ratings=@ratingshash.keys
    @movies=@movies.where(rating:@ratings)
---
SELECT "movies".* FROM "movies" WHERE (rating in ('G','PG','hidden'))  ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date